use `esdp`;

insert into `disciplines` (name) values
    ('Спортивная гимнастика'),
    ('Художественная гимнастика'),
    ('Спортивная акробатика'),
    ('Аэробная гимнастика'),
    ('Батутная гимнастика');

CREATE TABLE `discipline_types`(
    `id`      INT auto_increment NOT NULL,
    `name`    varchar(128)       NOT NULL,
    `participants_amount_min` integer,
    `participants_amount_max` integer,
    `gender_id` int references `genders` (`id`),
    `is_del` boolean default false,
    `discipline_id` int references `disciplines` (`id`),
    PRIMARY KEY (`id`)
);

CREATE TABLE `genders`(
    `id`      INT auto_increment NOT NULL,
    `name`    varchar(128)       NOT NULL,
    `is_del` boolean not null default false,
    PRIMARY KEY (`id`)
);

INSERT INTO `genders`(name) VALUES
    ('Мужской'),
    ('Женский'),
    ('Смешанный');

#спортивная гимнастика
insert into `discipline_types` (name, discipline_id) values
    ('Спортивная гимнастика женщины', 1),
    ('Спортивная гимнастика мужчины', 1);

#худ гимнастика
insert into `discipline_types` (name, discipline_id) values
    ('Индивидуальная программа', 2);

#худ гимнастика
insert into `discipline_types` (name, discipline_id, participants_amount_min, participants_amount_max) values
    ('Групповые упражнения', 2, 5, 6);

#батут гимнастика
insert into `discipline_types` (name, discipline_id) values
    ('Индивидуальные прыжки на батуте', 5),
    ('Прыжки на акробатической дорожке', 5),
    ('Прыжки на двойном минитрампе', 5);

#батут гимнастика
insert into `discipline_types` (name, discipline_id, participants_amount_min, participants_amount_max) values
    ('Синхронные прыжки на батуте', 5, 2, 2);

#спорт акробатика
insert into `discipline_types` (name, discipline_id, participants_amount_min, participants_amount_max, gender_id) values
    ('Мужская пара', 3, 2, 2, 1),
    ('Женская пара', 3, 2, 2, 2),
    ('Смешанная пара', 3, 2, 2, 3),
    ('Женская группа', 3, 3, 3, 2),
    ('Мужская группа', 3, 4, 4, 1);

#аэробная гимнастика
insert into `discipline_types` (name, discipline_id, gender_id) values
    ('Индивидуальные выступления женщин', 4, 2),
    ('Индивидуальные выступления мужчин', 4, 1);

#аэробная гимнастика
insert into `discipline_types` (name, discipline_id, participants_amount_min, participants_amount_max, gender_id) values
    ('Смешанная пара', 4, 2, 2, 3),
    ('Трио', 4, 3, 3, 3),
    ('Группы', 4, 5, 5, 3),
    ('Танцевальная гимнастика', 4, 6, 8, 3),
    ('Гимнастическая платформа', 4, 6, 8, 3);

CREATE TABLE `age_categories`(
    `id`      INT auto_increment NOT NULL,
    `min_year` integer,
    `max_year` integer,
    `is_del` boolean default false,
    `rank_id` int references `ranks` (`id`),
    `discipline_type_id` int references `discipline_types` (`id`),
    PRIMARY KEY (`id`)
);

#спорт гимнастика жен
insert into `age_categories` (min_year, rank_id, discipline_type_id) values
    (2008, 3, 1),
    (2010, 4, 1);

#спорт гимнастика жен
insert into `age_categories` (min_year, max_year, rank_id, discipline_type_id) values
    (2009, 2011, 5, 1),
    (2010, 2013, 6, 1),
    (2012, 2014, 7, 1);

#спорт гимнастика муж
insert into `age_categories` (min_year, rank_id, discipline_type_id) values
    (2005, 3, 2);

#спорт гимнастика муж
insert into `age_categories` (min_year, max_year, rank_id, discipline_type_id) values
    (2007, 2004, 4, 2),
    (2009, 2006, 5, 2),
    (2011, 2008, 6, 2),
    (2012, 2010, 7, 2);

#худ инд и групп
insert into `age_categories` (min_year, max_year, discipline_type_id) values
    (2006, 2013, 3),
    (2006, 2013, 4);

#худ инд и групп
insert into `age_categories` (min_year, rank_id, discipline_type_id) values
    (2005, 3, 3),
    (2005, 3, 4);

#худ инд и групп
insert into `age_categories` (min_year, max_year, rank_id, discipline_type_id) values
    (2008, 2006, 4, 3),
    (2008, 2006, 4, 4);

#худ инд и групп
insert into `age_categories` (max_year, rank_id, discipline_type_id) values
    (2009, 5, 3),
    (2009, 5, 4);

#батут гимн
insert into `age_categories` (max_year, discipline_type_id) values
    (2009, 5),
    (2009, 6),
    (2009, 7),
    (2009, 8);

#батут гимн
insert into `age_categories` (min_year, max_year, discipline_type_id) values
    (2008, 2007, 5),
    (2008, 2007, 6),
    (2008, 2007, 7),
    (2008, 2007, 8),
    (2006, 2005, 5),
    (2006, 2005, 6),
    (2006, 2005, 7),
    (2006, 2005, 8),
    (2004, 2000, 5),
    (2004, 2000, 6),
    (2004, 2000, 7),
    (2004, 2000, 8);

#батут гимн
insert into `age_categories` (min_year, discipline_type_id) values
    (2009, 5),
    (2009, 6),
    (2009, 7),
    (2009, 8);

#спорт акроб
insert into `age_categories` (max_year, discipline_type_id) values
    (2006, 9),
    (2006, 10),
    (2006, 11),
    (2006, 12),
    (2006, 13),
    (2004, 9),
    (2004, 10),
    (2004, 11),
    (2004, 12),
    (2004, 13);

#спорт акроб
insert into `age_categories` (min_year, discipline_type_id) values
    (2009, 9),
    (2009, 10),
    (2009, 11),
    (2009, 12),
    (2009, 13);

#спорт акроб
insert into `age_categories` (min_year, max_year, discipline_type_id) values
    (2009, 2003, 9),
    (2009, 2003, 10),
    (2009, 2003, 11),
    (2009, 2003, 12),
    (2009, 2003, 13),
    (2008, 2002, 9),
    (2008, 2002, 10),
    (2008, 2002, 11),
    (2008, 2002, 12),
    (2008, 2002, 13);

#аэроб гимн
insert into `age_categories` (min_year, discipline_type_id) values
    (2002, 14),
    (2002, 15),
    (2002, 16),
    (2002, 17),
    (2002, 18),
    (2002, 19),
    (2002, 20);

#аэроб гимн
insert into `age_categories` (min_year, max_year, discipline_type_id) values
    (2003, 2005, 14),
    (2003, 2005, 15),
    (2003, 2005, 16),
    (2003, 2005, 17),
    (2003, 2005, 18),
    (2003, 2005, 19),
    (2003, 2005, 20),
    (2006, 2008, 14),
    (2006, 2008, 15),
    (2006, 2008, 16),
    (2006, 2008, 17),
    (2006, 2008, 18),
    (2006, 2008, 19),
    (2006, 2008, 20);

CREATE TABLE `competition_programs`(
    `id`      INT auto_increment NOT NULL,
    `name`    varchar(128)       NOT NULL,
    `is_del` boolean default false,
    `age_category_id` int references `age_categories` (`id`),
    `discipline_type_id` integer references `discipline_types` (`id`),
    PRIMARY KEY (`id`)
);

#спорт гимн женщ
insert into `competition_programs` (name, discipline_type_id, age_category_id) values
    ('Командное первенство', 1, 1),
    ('Командное первенство', 1, 2),
    ('Командное первенство', 1, 3),
    ('Командное первенство', 1, 4),
    ('Командное первенство', 1, 5),
    ('Многоборье', 1, 1),
    ('Многоборье', 1, 2),
    ('Многоборье', 1, 3),
    ('Многоборье', 1, 4),
    ('Многоборье', 1, 5),
    ('Вольные упражнения', 1, 1),
    ('Вольные упражнения', 1, 2),
    ('Вольные упражнения', 1, 3),
    ('Вольные упражнения', 1, 4),
    ('Вольные упражнения', 1, 5),
    ('Брусья', 1, 1),
    ('Брусья', 1, 2),
    ('Брусья', 1, 3),
    ('Брусья', 1, 4),
    ('Брусья', 1, 5),
    ('Бревно', 1, 1),
    ('Бревно', 1, 2),
    ('Бревно', 1, 3),
    ('Бревно', 1, 4),
    ('Бревно', 1, 5),
    ('Опорный прыжок', 1, 1),
    ('Опорный прыжок', 1, 2),
    ('Опорный прыжок', 1, 3),
    ('Опорный прыжок', 1, 4),
    ('Опорный прыжок', 1, 5);


#спорт гимн женщ
insert into `competition_programs` (name, discipline_type_id, age_category_id) values
    ('Командное первенство', 2, 6),
    ('Командное первенство', 2, 7),
    ('Командное первенство', 2, 8),
    ('Командное первенство', 2, 9),
    ('Командное первенство', 2, 10),
    ('Многоборье', 2, 6),
    ('Многоборье', 2, 7),
    ('Многоборье', 2, 8),
    ('Многоборье', 2, 9),
    ('Многоборье', 2, 10),
    ('Вольные упражнения', 2, 6),
    ('Вольные упражнения', 2, 7),
    ('Вольные упражнения', 2, 8),
    ('Вольные упражнения', 2, 9),
    ('Вольные упражнения', 2, 10),
    ('Брусья', 2, 6),
    ('Брусья', 2, 7),
    ('Брусья', 2, 8),
    ('Брусья', 2, 9),
    ('Брусья', 2, 10),
    ('Бревно', 2, 6),
    ('Бревно', 2, 7),
    ('Бревно', 2, 8),
    ('Бревно', 2, 9),
    ('Бревно', 2, 10),
    ('Опорный прыжок', 2, 6),
    ('Опорный прыжок', 2, 7),
    ('Опорный прыжок', 2, 8),
    ('Опорный прыжок', 2, 9),
    ('Опорный прыжок', 2, 10);

#худ гимн инд
insert into `competition_programs` (name, discipline_type_id, age_category_id) values
    ('Командное первенство', 3, 11),
    ('Командное первенство', 3, 13),
    ('Командное первенство', 3, 15),
    ('Командное первенство', 3, 17),
    ('Многоборье', 3, 11),
    ('Многоборье', 3, 13),
    ('Многоборье', 3, 15),
    ('Многоборье', 3, 17),
    ('Без предмета', 3, 11),
    ('Без предмета', 3, 13),
    ('Без предмета', 3, 15),
    ('Без предмета', 3, 17),
    ('Скакалка', 3, 11),
    ('Скакалка', 3, 13),
    ('Скакалка', 3, 15),
    ('Скакалка', 3, 17),
    ('Обруч', 3, 11),
    ('Обруч', 3, 13),
    ('Обруч', 3, 15),
    ('Обруч', 3, 17),
    ('Мяч', 3, 11),
    ('Мяч', 3, 13),
    ('Мяч', 3, 15),
    ('Мяч', 3, 17),
    ('Булавы', 3, 11),
    ('Булавы', 3, 13),
    ('Булавы', 3, 15),
    ('Булавы', 3, 17),
    ('Лента', 3, 11),
    ('Лента', 3, 13),
    ('Лента', 3, 15),
    ('Лента', 3, 17);

#худ гимн групп
insert into `competition_programs` (name, discipline_type_id, age_category_id) values
    ('Многоборье', 3, 12),
    ('Многоборье', 3, 14),
    ('Многоборье', 3, 16),
    ('Многоборье', 3, 18),
    ('5 предметов', 3, 12),
    ('5 предметов', 3, 14),
    ('5 предметов', 3, 16),
    ('5 предметов', 3, 18),
    ('2+3 предмета', 3, 12),
    ('2+3 предмета', 3, 14),
    ('2+3 предмета', 3, 16),
    ('2+3 предмета', 3, 18);

#бабут гимн
insert into `competition_programs` (name, discipline_type_id, age_category_id) values
    ('Командное первенство', 5, 19),
    ('Командное первенство', 5, 20),
    ('Командное первенство', 5, 21),
    ('Командное первенство', 5, 22),
    ('Командное первенство', 5, 23),
    ('Командное первенство', 5, 24),
    ('Командное первенство', 5, 25),
    ('Командное первенство', 5, 26),
    ('Командное первенство', 5, 27),
    ('Командное первенство', 5, 28),
    ('Командное первенство', 5, 29),
    ('Командное первенство', 5, 30),
    ('Командное первенство', 5, 31),
    ('Командное первенство', 5, 32),
    ('Командное первенство', 5, 33),
    ('Командное первенство', 5, 34),
    ('Командное первенство', 6, 19),
    ('Командное первенство', 6, 20),
    ('Командное первенство', 6, 21),
    ('Командное первенство', 6, 22),
    ('Командное первенство', 6, 23),
    ('Командное первенство', 6, 24),
    ('Командное первенство', 6, 25),
    ('Командное первенство', 6, 26),
    ('Командное первенство', 6, 27),
    ('Командное первенство', 6, 28),
    ('Командное первенство', 6, 29),
    ('Командное первенство', 6, 30),
    ('Командное первенство', 6, 31),
    ('Командное первенство', 6, 32),
    ('Командное первенство', 6, 33),
    ('Командное первенство', 6, 34),
    ('Командное первенство', 7, 19),
    ('Командное первенство', 7, 20),
    ('Командное первенство', 7, 21),
    ('Командное первенство', 7, 22),
    ('Командное первенство', 7, 23),
    ('Командное первенство', 7, 24),
    ('Командное первенство', 7, 25),
    ('Командное первенство', 7, 26),
    ('Командное первенство', 7, 27),
    ('Командное первенство', 7, 28),
    ('Командное первенство', 7, 29),
    ('Командное первенство', 7, 30),
    ('Командное первенство', 7, 31),
    ('Командное первенство', 7, 32),
    ('Командное первенство', 7, 33),
    ('Командное первенство', 7, 34),
    ('Командное первенство', 8, 19),
    ('Командное первенство', 8, 20),
    ('Командное первенство', 8, 21),
    ('Командное первенство', 8, 22),
    ('Командное первенство', 8, 23),
    ('Командное первенство', 8, 24),
    ('Командное первенство', 8, 25),
    ('Командное первенство', 8, 26),
    ('Командное первенство', 8, 27),
    ('Командное первенство', 8, 28),
    ('Командное первенство', 8, 29),
    ('Командное первенство', 8, 30),
    ('Командное первенство', 8, 31),
    ('Командное первенство', 8, 32),
    ('Командное первенство', 8, 33),
    ('Командное первенство', 8, 34),
    ('Многоборье', 5, 19),
    ('Многоборье', 5, 20),
    ('Многоборье', 5, 21),
    ('Многоборье', 5, 22),
    ('Многоборье', 5, 23),
    ('Многоборье', 5, 24),
    ('Многоборье', 5, 25),
    ('Многоборье', 5, 26),
    ('Многоборье', 5, 27),
    ('Многоборье', 5, 28),
    ('Многоборье', 5, 29),
    ('Многоборье', 5, 30),
    ('Многоборье', 5, 31),
    ('Многоборье', 5, 32),
    ('Многоборье', 5, 33),
    ('Многоборье', 5, 34),
    ('Многоборье', 6, 19),
    ('Многоборье', 6, 20),
    ('Многоборье', 6, 21),
    ('Многоборье', 6, 22),
    ('Многоборье', 6, 23),
    ('Многоборье', 6, 24),
    ('Многоборье', 6, 25),
    ('Многоборье', 6, 26),
    ('Многоборье', 6, 27),
    ('Многоборье', 6, 28),
    ('Многоборье', 6, 29),
    ('Многоборье', 6, 30),
    ('Многоборье', 6, 31),
    ('Многоборье', 6, 32),
    ('Многоборье', 6, 33),
    ('Многоборье', 6, 34),
    ('Многоборье', 7, 19),
    ('Многоборье', 7, 20),
    ('Многоборье', 7, 21),
    ('Многоборье', 7, 22),
    ('Многоборье', 7, 23),
    ('Многоборье', 7, 24),
    ('Многоборье', 7, 25),
    ('Многоборье', 7, 26),
    ('Многоборье', 7, 27),
    ('Многоборье', 7, 28),
    ('Многоборье', 7, 29),
    ('Многоборье', 7, 30),
    ('Многоборье', 7, 31),
    ('Многоборье', 7, 32),
    ('Многоборье', 7, 33),
    ('Многоборье', 7, 34),
    ('Многоборье', 8, 19),
    ('Многоборье', 8, 20),
    ('Многоборье', 8, 21),
    ('Многоборье', 8, 22),
    ('Многоборье', 8, 23),
    ('Многоборье', 8, 24),
    ('Многоборье', 8, 25),
    ('Многоборье', 8, 26),
    ('Многоборье', 8, 27),
    ('Многоборье', 8, 28),
    ('Многоборье', 8, 29),
    ('Многоборье', 8, 30),
    ('Многоборье', 8, 31),
    ('Многоборье', 8, 32),
    ('Многоборье', 8, 33),
    ('Многоборье', 8, 34),
    ('1 упражнение', 5, 19),
    ('1 упражнение', 5, 20),
    ('1 упражнение', 5, 21),
    ('1 упражнение', 5, 22),
    ('1 упражнение', 5, 23),
    ('1 упражнение', 5, 24),
    ('1 упражнение', 5, 25),
    ('1 упражнение', 5, 26),
    ('1 упражнение', 5, 27),
    ('1 упражнение', 5, 28),
    ('1 упражнение', 5, 29),
    ('1 упражнение', 5, 30),
    ('1 упражнение', 5, 31),
    ('1 упражнение', 5, 32),
    ('1 упражнение', 5, 33),
    ('1 упражнение', 5, 34),
    ('1 упражнение', 6, 19),
    ('1 упражнение', 6, 20),
    ('1 упражнение', 6, 21),
    ('1 упражнение', 6, 22),
    ('1 упражнение', 6, 23),
    ('1 упражнение', 6, 24),
    ('1 упражнение', 6, 25),
    ('1 упражнение', 6, 26),
    ('1 упражнение', 6, 27),
    ('1 упражнение', 6, 28),
    ('1 упражнение', 6, 29),
    ('1 упражнение', 6, 30),
    ('1 упражнение', 6, 31),
    ('1 упражнение', 6, 32),
    ('1 упражнение', 6, 33),
    ('1 упражнение', 6, 34),
    ('1 упражнение', 7, 19),
    ('1 упражнение', 7, 20),
    ('1 упражнение', 7, 21),
    ('1 упражнение', 7, 22),
    ('1 упражнение', 7, 23),
    ('1 упражнение', 7, 24),
    ('1 упражнение', 7, 25),
    ('1 упражнение', 7, 26),
    ('1 упражнение', 7, 27),
    ('1 упражнение', 7, 28),
    ('1 упражнение', 7, 29),
    ('1 упражнение', 7, 30),
    ('1 упражнение', 7, 31),
    ('1 упражнение', 7, 32),
    ('1 упражнение', 7, 33),
    ('1 упражнение', 7, 34),
    ('1 упражнение', 8, 19),
    ('1 упражнение', 8, 20),
    ('1 упражнение', 8, 21),
    ('1 упражнение', 8, 22),
    ('1 упражнение', 8, 23),
    ('1 упражнение', 8, 24),
    ('1 упражнение', 8, 25),
    ('1 упражнение', 8, 26),
    ('1 упражнение', 8, 27),
    ('1 упражнение', 8, 28),
    ('1 упражнение', 8, 29),
    ('1 упражнение', 8, 30),
    ('1 упражнение', 8, 33),
    ('1 упражнение', 8, 34),
    ('2 упражнение', 5, 19),
    ('2 упражнение', 5, 20),
    ('2 упражнение', 5, 21),
    ('2 упражнение', 5, 22),
    ('2 упражнение', 5, 23),
    ('2 упражнение', 5, 24),
    ('2 упражнение', 5, 25),
    ('2 упражнение', 5, 26),
    ('2 упражнение', 5, 27),
    ('2 упражнение', 5, 28),
    ('2 упражнение', 5, 29),
    ('2 упражнение', 5, 30),
    ('2 упражнение', 5, 31),
    ('2 упражнение', 5, 32),
    ('2 упражнение', 5, 33),
    ('2 упражнение', 5, 34),
    ('2 упражнение', 6, 19),
    ('2 упражнение', 6, 20),
    ('2 упражнение', 6, 21),
    ('2 упражнение', 6, 22),
    ('2 упражнение', 6, 23),
    ('2 упражнение', 6, 24),
    ('2 упражнение', 6, 25),
    ('2 упражнение', 6, 26),
    ('2 упражнение', 6, 27),
    ('2 упражнение', 6, 28),
    ('2 упражнение', 6, 29),
    ('2 упражнение', 6, 30),
    ('2 упражнение', 6, 31),
    ('2 упражнение', 6, 32),
    ('2 упражнение', 6, 33),
    ('2 упражнение', 6, 34),
    ('2 упражнение', 7, 19),
    ('2 упражнение', 7, 20),
    ('2 упражнение', 7, 21),
    ('2 упражнение', 7, 22),
    ('2 упражнение', 7, 23),
    ('2 упражнение', 7, 24),
    ('2 упражнение', 7, 25),
    ('2 упражнение', 7, 26),
    ('2 упражнение', 7, 27),
    ('2 упражнение', 7, 28),
    ('2 упражнение', 7, 29),
    ('2 упражнение', 7, 30),
    ('2 упражнение', 7, 31),
    ('2 упражнение', 7, 32),
    ('2 упражнение', 7, 33),
    ('2 упражнение', 7, 34),
    ('2 упражнение', 8, 19),
    ('2 упражнение', 8, 20),
    ('2 упражнение', 8, 21),
    ('2 упражнение', 8, 22),
    ('2 упражнение', 8, 23),
    ('2 упражнение', 8, 24),
    ('2 упражнение', 8, 25),
    ('2 упражнение', 8, 26),
    ('2 упражнение', 8, 27),
    ('2 упражнение', 8, 28),
    ('2 упражнение', 8, 29),
    ('2 упражнение', 8, 30),
    ('2 упражнение', 8, 31),
    ('2 упражнение', 8, 32),
    ('2 упражнение', 8, 33),
    ('2 упражнение', 8, 34);

#спорт акр
insert into `competition_programs` (name, discipline_type_id) values
    ('Командное первенство', 9),
    ('Командное первенство', 10),
    ('Командное первенство', 11),
    ('Командное первенство', 12),
    ('Командное первенство', 13),
    ('Многоборье', 9),
    ('Многоборье', 10),
    ('Многоборье', 11),
    ('Многоборье', 12),
    ('Многоборье', 13),
    ('1 упражнение', 9),
    ('1 упражнение', 10),
    ('1 упражнение', 11),
    ('1 упражнение', 12),
    ('1 упражнение', 13),
    ('2 упражнение', 9),
    ('2 упражнение', 10),
    ('2 упражнение', 11),
    ('2 упражнение', 12),
    ('2 упражнение', 13),
    ('3 упражнение', 9),
    ('3 упражнение', 10),
    ('3 упражнение', 11),
    ('3 упражнение', 12),
    ('3 упражнение', 13);

#аэроб гимн
insert into `competition_programs` (name, discipline_type_id) values
    ('Командное первенство', 14),
    ('Командное первенство', 15),
    ('Командное первенство', 16),
    ('Командное первенство', 17),
    ('Командное первенство', 18),
    ('Командное первенство', 19),
    ('Командное первенство', 20),
    ('Индивидуальные выступление', 14),
    ('Индивидуальные выступление', 15),
    ('Индивидуальные выступление', 16),
    ('Индивидуальные выступление', 17),
    ('Индивидуальные выступление', 18),
    ('Индивидуальные выступление', 19),
    ('Индивидуальные выступление', 20);



