use `esdp`;

CREATE TABLE `discipline_types`
(
    `id`      INT auto_increment NOT NULL,
    `name`    varchar(128)       NOT NULL,
    `is_del` boolean default false,
    `discipline_id` int references `disciplines` (`id`),
    PRIMARY KEY (`id`)
);

insert into `discipline_types` (name, discipline_id) values
    ('Индивидуальная программа', 2),
    ('Групповые упражнения', 2),
    ('Индивидуальные прыжки на батуте', 6),
    ('Синхронные прыжки на батуте', 6),
    ('Прыжки на акробатической дорожке', 6),
    ('Прыжки на двойном минитрампе', 6),
    ('Мужская пара', 4),
    ('Женская пара', 4),
    ('Смешанная пара', 4),
    ('Женская группа', 4),
    ('Мужская группа', 4),
    ('Индивидуальные выступления женщин', 5),
    ('Индивидуальные выступления мужчин', 5),
    ('Смешанная пара', 5),
    ('Трио', 5),
    ('Группы', 5),
    ('Гимнастическая платформа', 5);

CREATE TABLE `competition_programs`
(
    `id`      INT auto_increment NOT NULL,
    `name`    varchar(128)       NOT NULL,
    `is_del` boolean default false,
    `type` varchar(100),
    `discipline_id` int references `disciplines` (`id`),
    PRIMARY KEY (`id`)
);

insert into `competition_programs` (name, discipline_id, type) values
     ('Командное первенство', 2, 'Индивидуальная_программа'),
     ('Многоборье', 2, 'Индивидуальная_программа'),
     ('Без предмета', 2, 'Индивидуальная_программа'),
     ('Скакалка', 2, 'Индивидуальная_программа'),
     ('Обруч', 2, 'Индивидуальная_программа'),
     ('Мяч', 2, 'Индивидуальная_программа'),
     ('Булавы', 2, 'Индивидуальная_программа'),
     ('Лента', 2, 'Индивидуальная_программа'),
     ('Многоборье ', 2, 'Групповые_упражнения'),
     ('5 предметов ', 2, 'Групповые_упражнения'),
     ('2+3 предмета ', 2, 'Групповые_упражнения');

insert into `competition_programs` (name, discipline_id) values
    ('Командное первенство', 3),
    ('Многоборье', 3),
    ('Вольные упражнения', 3),
    ('Брусья', 3),
    ('Бревно', 3),
    ('Опорный прыжок', 3),
    ('Командное первенство', 1),
    ('Многоборье', 1),
    ('Вольные упражнения', 1),
    ('Брусья', 1),
    ('Бревно', 1),
    ('Опорный прыжок', 1),
    ('Конь', 1),
    ('Кольца', 1),
    ('Брусья', 1),
    ('Перекладина', 1),
    ('Командное первенство по прыжкам на батуте', 6),
    ('Командное первенство по прыжкам на акробатической дорожке', 6),
    ('Командное первенство по прыжкам на двойном минитрампе', 6),
    ('Индивидуальные прыжки на батуте', 6),
    ('Синхронные прыжки на батуте', 6),
    ('Прыжки на акробатической дорожке', 6),
    ('Прыжки на двойном минитрампе', 6),
    ('Командное первенство', 4),
    ('Многоборье', 4),
    ('Финал в отдельных видах', 4);

CREATE TABLE `age_categories`
(
    `id`      INT auto_increment NOT NULL,
    `min_year` integer,
    `max_year` integer,
    `is_del` boolean default false,
    `discipline_id` int references `disciplines` (`id`),
    `rank_id` int references `ranks` (`id`),
    PRIMARY KEY (`id`)
);

insert into `age_categories` (min_year, discipline_id, rank_id) values
    (2008, 3, 3),
    (2010, 3, 4),
    (2010, 3, 4),
    (2005, 1, 3),
    (2005, 1, 3),
    (2005, 2, 3);


insert into `age_categories` (min_year, max_year, discipline_id, rank_id) values
    (2009, 2011, 3, 5),
    (2010, 2013, 3, 6),
    (2012, 2014, 3, 7),
    (2004, 2007, 1, 4),
    (2006, 2009, 1, 5),
    (2008, 2011, 1, 6),
    (2010, 2012, 1, 7),
    (2006, 2008, 2, 4),
    (2006, 2008, 2, 4);

insert into `age_categories` (max_year, discipline_id, rank_id) values
    (2009, 2, 5),
    (2009, 2, 5);

insert into `age_categories` (min_year, max_year, discipline_id) values
    (2006, 2013, 2),
    (2021, 2009, 6),
    (2008, 2007, 6),
    (2006, 2005, 6),
    (2004, 2000, 6),
    (2021, 2006, 4),
    (2021, 2003, 4),
    (2009, 2002, 4),
    (2008, 2001, 4),
    (2009, 1921, 4),
    (2002, 1909, 5),
    (2003, 2005, 5),
    (2006, 2008, 5);


